## Plan Result (nonprod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 16 to change, 4 to destroy.</code></pre>

* Update
  * module.access_management.sendgrid_api_key.subuser
  * module.adoption.sendgrid_api_key.subuser
  * module.civil.sendgrid_api_key.subuser
  * module.cmc.sendgrid_api_key.subuser
  * module.damages.sendgrid_api_key.subuser
  * module.db_reporting.sendgrid_api_key.subuser
  * module.dcs.sendgrid_api_key.subuser
  * module.divorce.sendgrid_api_key.subuser
  * module.employment_tribunals.sendgrid_api_key.subuser
  * module.nessus.sendgrid_api_key.subuser
  * module.panorama.sendgrid_api_key.subuser
  * module.payment.sendgrid_api_key.subuser
  * module.pcol.sendgrid_api_key.subuser
  * module.private_law.sendgrid_api_key.subuser
  * module.reference_data.sendgrid_api_key.subuser
  * module.sscs.sendgrid_api_key.subuser
* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.access_management.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "_EgBy7R3TNKyKm23bJu7xQ"
        name    = "access-management-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.adoption.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "t2aJHSqBRzWtBjEfcbHDVQ"
        name    = "adoption-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.civil.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "aLTD7lSmSF-eqLcPaa2WWQ"
        name    = "civil-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.cmc.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "n02NDtXeSXWyKYKm8z53OQ"
        name    = "cmc-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.damages.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "OCuslYpkT3y1xN63zRWCTA"
        name    = "damages-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.db_reporting.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "9uCoDThYT9eT0gHtfW_FRA"
        name    = "db-reporting-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.dcs.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "bX7K7D1dR2-TKJwZT5LAAA"
        name    = "dcs-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.divorce.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "n-IOd75JQESmij1EdpppUQ"
        name    = "divorce-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.employment_tribunals.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "c8qL0mJlSFWK-tzA5BkVKg"
        name    = "employment-tribunals-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.nessus.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "eVRQggkxTXi3AGrXYJ8Amg"
        name    = "nessus-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.panorama.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "JCt_qAz4SKCKebUn7KyG0Q"
        name    = "panorama-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.payment.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "Bzghz-OMRsmvb0dWSiEfqA"
        name    = "payment-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.pcol.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "MBkHGBBsTyyVLbQa0JBRwg"
        name    = "pcol-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "pnl" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "pnl.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "pnl2.domainkey.u33702686.wl187.sendgrid.net"
              - host  = "pnl2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702686.wl187.sendgrid.net"
              - host  = "em9474.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "18133099" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em9474" -> (known after apply)
      ~ username             = "hmcts-pcol-nonprod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "pnl._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl._domainkey" -> (known after apply)
      ~ name                = "pnl._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "pnl2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/pnl2._domainkey" -> (known after apply)
      ~ name                = "pnl2._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "pnl2.domainkey.u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em9474.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em9474" -> (known after apply)
      ~ name                = "em9474" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "u33702686.wl187.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.private_law.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "s-Ezmx14QbeK1hwxJdzLIg"
        name    = "private-law-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.reference_data.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "D_RafyFQRNGdTkJOJvdh2A"
        name    = "reference-data-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.sscs.sendgrid_api_key.subuser will be updated in-place
  ~ resource "sendgrid_api_key" "subuser" {
        id      = "Mk463fk_S1SfwtU0a4tPXg"
        name    = "sscs-application"
      ~ scopes  = [
          - "2fa_exempt",
            # (7 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 16 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":62,"Program":"tfcmt","SHA1":"","Target":"nonprod","Vars":{}} -->